nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/can/processor/can_p32mx570f512h.h
/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API void PLIB_CAN_DeviceNetConfigure(CAN_MODULE_ID index, CAN_DNET_FILTER_SIZE dncnt)
{
     CAN_DeviceNetConfigure_Default(index, dncnt);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsDeviceNet(CAN_MODULE_ID index)
{
     return CAN_ExistsDeviceNet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_IsActive(CAN_MODULE_ID index)
{
     return CAN_IsActive_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsActiveStatus(CAN_MODULE_ID index)
{
     return CAN_ExistsActiveStatus_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_StopInIdleEnable(CAN_MODULE_ID index)
{
     CAN_StopInIdleEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_StopInIdleDisable(CAN_MODULE_ID index)
{
     CAN_StopInIdleDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsStopInIdle(CAN_MODULE_ID index)
{
     return CAN_ExistsStopInIdle_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_Enable(CAN_MODULE_ID index)
{
     CAN_Enable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_Disable(CAN_MODULE_ID index)
{
     CAN_Disable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsEnableControl(CAN_MODULE_ID index)
{
     return CAN_ExistsEnableControl_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampEnable(CAN_MODULE_ID index)
{
     CAN_TimeStampEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampDisable(CAN_MODULE_ID index)
{
     CAN_TimeStampDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTimeStampEnable(CAN_MODULE_ID index)
{
     return CAN_ExistsTimeStampEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampValueSet(CAN_MODULE_ID index, unsigned value)
{
     CAN_TimeStampValueSet_Default(index, value);
}

PLIB_INLINE_API unsigned PLIB_CAN_TimeStampValueGet(CAN_MODULE_ID index)
{
     return CAN_TimeStampValueGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTimeStampValue(CAN_MODULE_ID index)
{
     return CAN_ExistsTimeStampValue_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_BusActivityWakeupEnable(CAN_MODULE_ID index)
{
     CAN_BusActivityWakeupEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_BusActivityWakeupDisable(CAN_MODULE_ID index)
{
     CAN_BusActivityWakeupDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsBusActivityWakeup(CAN_MODULE_ID index)
{
     return CAN_ExistsBusActivityWakeup_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_MemoryBufferAssign(CAN_MODULE_ID index, void* buffer)
{
     CAN_MemoryBufferAssign_Default(index, buffer);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsMemoryBufferAssign(CAN_MODULE_ID index)
{
     return CAN_ExistsMemoryBufferAssign_Default(index);
}

PLIB_INLINE_API CAN_OPERATION_MODES PLIB_CAN_OperationModeGet(CAN_MODULE_ID index)
{
     return CAN_OperationModeGet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsOperationModeRead(CAN_MODULE_ID index)
{
     return CAN_ExistsOperationModeRead_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_OperationModeSelect(CAN_MODULE_ID index, CAN_OPERATION_MODES opMode)
{
     CAN_OperationModeSelect_Default(index, opMode);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsOperationModeWrite(CAN_MODULE_ID index)
{
     return CAN_ExistsOperationModeWrite_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_TimeStampPrescalerSet(CAN_MODULE_ID index, unsigned preScaler)
{
     CAN_TimeStampPrescalerSet_Default(index, preScaler);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsTimeStampPrescaler(CAN_MODULE_ID index)
{
     return CAN_ExistsTimeStampPrescaler_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_PhaseSegment2LengthSet(CAN_MODULE_ID index, CAN_TIME_SEGMENT_LENGTH length)
{
     CAN_PhaseSegment2LengthSet_Default(index, length);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPhaseSegment2Length(CAN_MODULE_ID index)
{
     return CAN_ExistsPhaseSegment2Length_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_PhaseSegment1LengthSet(CAN_MODULE_ID index, CAN_TIME_SEGMENT_LENGTH length)
{
     CAN_PhaseSegment1LengthSet_Default(index, length);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPhaseSegment1Length(CAN_MODULE_ID index)
{
     return CAN_ExistsPhaseSegment1Length_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_PhaseSegment2LengthFreelyProgrammableEnable(CAN_MODULE_ID index)
{
     CAN_PhaseSegment2LengthFreelyProgrammableEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_PhaseSegment2LengthFreelyProgrammableDisable(CAN_MODULE_ID index)
{
     CAN_PhaseSegment2LengthFreelyProgrammableDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPhaseSegment2LengthFreelyProgrammable(CAN_MODULE_ID index)
{
     return CAN_ExistsPhaseSegment2LengthFreelyProgrammable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_BusLine3TimesSamplingEnable(CAN_MODULE_ID index)
{
     CAN_BusLine3TimesSamplingEnable_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_BusLine3TimesSamplingDisable(CAN_MODULE_ID index)
{
     CAN_BusLine3TimesSamplingDisable_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsBusLine3TimesSampling(CAN_MODULE_ID index)
{
     return CAN_ExistsBusLine3TimesSampling_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_PropagationTimeSegmentSet(CAN_MODULE_ID index, CAN_TIME_SEGMENT_LENGTH length)
{
     CAN_PropagationTimeSegmentSet_Default(index, length);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPropagationTimeSegment(CAN_MODULE_ID index)
{
     return CAN_ExistsPropagationTimeSegment_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_SyncJumpWidthSet(CAN_MODULE_ID index, CAN_TIME_SEGMENT_LENGTH length)
{
     CAN_SyncJumpWidthSet_Default(index, length);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsSyncJumpWidthSet(CAN_MODULE_ID index)
{
     return CAN_ExistsSyncJumpWidthSet_Default(index);
}

PLIB_INLINE_API void PLIB_CAN_BaudRatePrescaleSet(CAN_MODULE_ID index, CAN_BAUD_RATE_PRESCALE prescale)
{
     CAN_BaudRatePrescaleSet_Default(index, prescale);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsBaudRatePrescale(CAN_MODULE_ID index)
{
     return CAN_ExistsBaudRatePrescale_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_PrecalculatedBitRateSetup(CAN_MODULE_ID index, uint8_t prescale, uint8_t syncjumpWidth, uint8_t propagation, uint8_t segment1, uint8_t segment2)
{
     return CAN_PrecalculatedBitRateSetup_Default(index, prescale, syncjumpWidth, propagation, segment1, segment2);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsPrecalculatedBitRateSetup(CAN_MODULE_ID index)
{
     return CAN_ExistsPrecalculatedBitRateSetup_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_BitSamplePhaseSet(CAN_MODULE_ID index, uint8_t syncJumpWidth, uint8_t propagation, uint8_t segment1, uint8_t segment2)
{
     return CAN_BitSamplePhaseSet_Default(index, syncJumpWidth, propagation, segment1, segment2);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsBitSamplePhaseSet(CAN_MODULE_ID index)
{
     return CAN_ExistsBitSamplePhaseSet_Default(index);
}

PLIB_INLINE_API bool PLIB_CAN_BaudRatePrescaleSetup(CAN_MODULE_ID index, uint16_t prescale)
{
     return CAN_BaudRatePrescaleSetup_Default(index, prescale);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsBaudRatePrescaleSetup(CAN_MODULE_ID index)
{
     return CAN_ExistsBaudRatePrescaleSetup_Default(index);
}

PLIB_INLINE_API uint32_t PLIB_CAN_BaudRateGet(CAN_MODULE_ID index, uint32_t sysclock)
{
     return CAN_BaudRateGet_Default(index, sysclock);
}

PLIB_INLINE_API bool PLIB_CAN_ExistsBaudRateGet(CAN_MODULE_ID index)
{
     return CAN_ExistsBaudRateGet_Default(index);
}

